-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Дек 05 2022 г., 18:50
-- Версия сервера: 10.3.22-MariaDB
-- Версия PHP: 7.1.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `shop`
--

-- --------------------------------------------------------

--
-- Структура таблицы `shop`
--

CREATE TABLE `shop` (
  `name` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `card_id` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `address` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `lon` double NOT NULL,
  `lat` double NOT NULL,
  `working_hour` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `working_days` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `floor` tinyint(11) NOT NULL,
  `shop_id` int(10) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='Данная таблица содержит данные о магазинах Новосибирска';

--
-- Дамп данных таблицы `shop`
--

INSERT INTO `shop` (`name`, `card_id`, `address`, `lon`, `lat`, `working_hour`, `working_days`, `floor`, `shop_id`) VALUES
('Красное&Белое', '1', 'Морской проспект, 20,\r\n​Верхняя зона Академгородка м-н, Советский район, Новосибирск', 54.8395, 83.1068, '09:00-22:05', 'понедельник, вторник, среда, четверг, пятница, суббота, воскресенье', 1, 1),
('Красное&Белое', '2', 'бульвар Молодёжи, 15, Нижняя зона Академгородка м-н, Советский район, Новосибирск', 54.86422, 83.08595, '09:00-22:05', 'понедельник, вторник, среда, четверг, пятница, суббота, воскресенье', 1, 2),
('Быстроном', '3', 'Инженерная, 5/1, Верхняя зона Академгородка м-н, Советский район, Новосибирск', 54.86, 83.10868, '07:00-24:00', 'понедельник, вторник, среда, четверг, пятница, суббота, воскресенье', 1, 3),
('Добрянка', '4', 'Кутателадзе, 4/4, Верхняя зона Академгородка м-н, Советский район, Новосибирск,', 54.85995, 83.10498, '08:00-23:00', 'понедельник, вторник, среда, четверг, пятница, суббота, воскресенье', 1, 4),
('Пятёрочка', '5', 'бульвар Молодёжи, 15, Нижняя зона Академгородка м-н, Советский район, Новосибирск', 54.86422, 83.08595, '08:00-22:00', 'понедельник, вторник, среда, четверг, пятница, суббота, воскресенье', 1, 5),
('Бристоль', '6', 'Миргородская 2-я, 3, Шлюз м-н, Советский район, Новосибирск', 54.8533, 83.0387, '08:00-22:00', 'понедельник, вторник, среда, четверг, пятница, суббота, воскресенье', 1, 6),
('Бристоль', '7', 'Балтийская, 35, Шлюз м-н, Советский район, Новосибирск', 54.85582, 83.05153, '08:00-22:00', 'понедельник, вторник, среда, четверг, пятница, суббота, воскресенье', 1, 7),
('Магнит', '8', 'Гнесиных, 10/1, Нижняя зона Академгородка м-н, Советский район, Новосибирск', 54.87048, 83.08829, '00:00-23:59', 'понедельник, вторник, среда, четверг, пятница, суббота, воскресенье', 1, 8),
('Магнит', '9', 'Шлюзовая, 26а, Шлюз м-н, Советский район, Новосибирск', 54.85259, 83.04546, '00:15-23:55', 'понедельник, вторник, среда, четверг, пятница, суббота, воскресенье', 1, 9),
('Магнит', '10', 'Добровольческая, 6, Шлюз м-н, Советский район, Новосибирск', 54.85011, 83.04499, '08:30-22:30', 'понедельник, вторник, среда, четверг, пятница, суббота, воскресенье', 1, 10),
('Л\'Этуаль', '11', 'Кутателадзе 4/4, Верхняя зона Академгородка м-н, Советский район, Новосибирск', 54.85995, 83.10498, '10:00 до 22:00', 'понедельник, вторник, среда, четверг, пятница, суббота, воскресенье', 1, 11);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `shop`
--
ALTER TABLE `shop`
  ADD PRIMARY KEY (`shop_id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `shop`
--
ALTER TABLE `shop`
  MODIFY `shop_id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
